micropython/micropython/ports/mimxrt/sdcard.c
    if (bus_width == kUSDHC_DataBusWidth1Bit) {
        command.argument = 0U;
    } else if (bus_width == kUSDHC_DataBusWidth4Bit) {
        command.argument = 2U;
    } else {
        return false;  // Invalid argument
    }

    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = sdcard_transfer_blocking(card->usdhc_inst, &transfer, 250);

    if (status == kStatus_Success) {
        card->status = command.response[0];
        return true;
    } else {
        return false;
    }
}

static bool sdcard_cmd_send_status(mimxrt_sdcard_obj_t *card) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_STATUS,
        .argument = (card->rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    status = sdcard_transfer_blocking(card->usdhc_inst, &transfer, 250);

    if (status == kStatus_Success) {
        card->status = command.response[0];
        return true;
    } else {
        return false;
    }
}

static bool sdcard_wait_ready(mimxrt_sdcard_obj_t *card, uint32_t timeout_ms) {
    uint32_t start = mp_hal_ticks_ms();

    while ((mp_hal_ticks_ms() - start) < timeout_ms) {
        if (!sdcard_cmd_send_status(card)) {
            return false;
        }

        // Check if card is ready for data (bit 8) and in transfer state (bits 9-12 == 4)
        uint32_t card_state = SDMMC_R1_CURRENT_STATE(card->status);
        bool ready_for_data = (card->status & SDMMC_MASK(SDCARD_STATUS_READY_FOR_DATA_SHIFT)) != 0;

        if (ready_for_data && (card_state == SDCARD_STATE_TRANSFER)) {
            return true;
        }

        // Allow other MicroPython tasks to run while polling
        MICROPY_EVENT_POLL_HOOK;
        mp_hal_delay_ms(1);  // Wait 1ms between polls
    }

    return false;  // Timeout
}

static bool sdcard_reset(mimxrt_sdcard_obj_t *card) {
    card->block_len = SDCARD_DEFAULT_BLOCK_SIZE;
    card->rca = 0UL;
    card->block_count = 0UL;
    card->status = 0UL;
    card->oper_cond = 0UL;
    card->state->initialized = false;
    return USDHC_Reset(card->usdhc_inst, (USDHC_SYS_CTRL_RSTA_MASK | USDHC_SYS_CTRL_RSTC_MASK | USDHC_SYS_CTRL_RSTD_MASK), 2048);
}

void sdcard_init(mimxrt_sdcard_obj_t *card, uint32_t base_clk) {
    #ifdef MIMXRT117x_SERIES
    clock_root_config_t rootCfg = {0};
    /* SYS PLL2 528MHz. */
    const clock_sys_pll2_config_t sysPll2Config = {
        .ssEnable = false,
    };

    CLOCK_InitSysPll2(&sysPll2Config);
    CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 24);

    rootCfg.mux = 4;
    rootCfg.div = 2;
    CLOCK_SetRootClock(kCLOCK_Root_Usdhc1, &rootCfg);

    #else

    // Configure PFD0 of PLL2 (system PLL) fractional divider to 24 resulting in:
    //  with PFD0_clk = PLL2_clk * 18 / N
    //       PFD0_clk = 528MHz   * 18 / 24 = 396MHz
    CLOCK_InitSysPfd(kCLOCK_Pfd0, 24U);

    #if defined MICROPY_USDHC1 && USDHC1_AVAIL
    // Configure USDHC clock source and divider
    CLOCK_SetDiv(kCLOCK_Usdhc1Div, 1U);  // USDHC_input_clk = PFD0_clk / 2 = 198MHZ
    CLOCK_SetMux(kCLOCK_Usdhc1Mux, 1U);  // Select PFD0 as clock input for USDHC
    #endif

    #if defined MICROPY_USDHC2 && USDHC2_AVAIL
    // Configure USDHC clock source and divider
    CLOCK_SetDiv(kCLOCK_Usdhc2Div, 1U);  // USDHC_input_clk = PFD0_clk / 2 = 198MHZ
    CLOCK_SetMux(kCLOCK_Usdhc2Mux, 1U);  // Select PFD0 as clock input for USDHC
    #endif

    #endif // MIMXRT117x_SERIES

    // ERR050396 workaround: Disable cacheable AXI transactions for USDHC
    // This is critical when GC heap is in cacheable OCRAM (SDRAM disabled).
    // The GPR28/GPR13 ARCACHE/AWCACHE bits control USDHC's AXI cache attributes
    // at the hardware level, ensuring DMA accesses bypass the L1 D-cache.
    #ifdef MIMXRT117x_SERIES
    IOMUXC_GPR->GPR28 &= ~(IOMUXC_GPR_GPR28_ARCACHE_USDHC_MASK | IOMUXC_GPR_GPR28_AWCACHE_USDHC_MASK);
    #else
    #if defined(IOMUXC_GPR_GPR13_ARCACHE_USDHC_MASK)
    IOMUXC_GPR->GPR13 &= ~(IOMUXC_GPR_GPR13_ARCACHE_USDHC_MASK | IOMUXC_GPR_GPR13_AWCACHE_USDHC_MASK);
    #endif
    #endif
    __DSB();  // Ensure GPR setting completes before USDHC initialization

    // Initialize USDHC
    const usdhc_config_t config = {
        .endianMode = kUSDHC_EndianModeLittle,
        .dataTimeout = 0xFU,
        .readWatermarkLevel = 128U,
        .writeWatermarkLevel = 128U,
    };
    USDHC_Init(card->usdhc_inst, &config);

    (void)sdcard_reset(card);
    card->base_clk = base_clk;

    usdhc_transfer_callback_t callbacks = {
        .CardInserted = sdcard_card_inserted_callback,
        .CardRemoved = sdcard_card_removed_callback,
        .SdioInterrupt = sdcard_dummy_callback,
        .BlockGap = sdcard_dummy_callback,
        .TransferComplete = NULL,  // Not used - we use blocking transfers
        .ReTuning = sdcard_dummy_callback,
    };

    USDHC_TransferCreateHandle(card->usdhc_inst, &card->handle, &callbacks, NULL);
}

void sdcard_deinit(mimxrt_sdcard_obj_t *card) {
    sdcard_power_off(card);
    USDHC_Deinit(card->usdhc_inst);
}

static inline void sdcard_init_pin(const machine_pin_obj_t *pin, uint8_t af_idx, uint32_t config_value) {
    machine_pin_af_obj_t af = pin->af_list[af_idx];

    IOMUXC_SetPinMux(pin->muxRegister, af.af_mode, af.input_register, af.input_daisy, pin->configRegister, 0U);
    IOMUXC_SetPinConfig(pin->muxRegister, af.af_mode, af.input_register, af.input_daisy, pin->configRegister, config_value);
}

void sdcard_init_pins(mimxrt_sdcard_obj_t *card) {
    // speed and strength optimized for clock frequency < 100MHz
    const mimxrt_sdcard_obj_pins_t *pins = card->pins;

    uint32_t default_config = pin_generate_config(
        PIN_PULL_UP_47K, PIN_MODE_SKIP, PIN_DRIVE_6, card->pins->clk.pin->configRegister);
    #if USDHC_DATA3_PULL_DOWN_ON_BOARD
    // Pull down on the board -> must not enable internal PD.
    uint32_t no_cd_config = pin_generate_config(
        PIN_PULL_DISABLED, PIN_MODE_SKIP, PIN_DRIVE_6, card->pins->data3.pin->configRegister);
    #else
    uint32_t no_cd_config = pin_generate_config(
        PIN_PULL_DOWN_100K, PIN_MODE_SKIP, PIN_DRIVE_6, card->pins->data3.pin->configRegister);
    #endif // USDHC_DATA3_PULL_DOWN_ON_BOARD

    sdcard_init_pin(card->pins->clk.pin, card->pins->clk.af_idx, default_config);  // USDHC1_CLK
    sdcard_init_pin(card->pins->cmd.pin, card->pins->cmd.af_idx, default_config);  // USDHC1_CMD
    sdcard_init_pin(card->pins->data0.pin, card->pins->data0.af_idx, default_config);  // USDHC1_DATA0
    sdcard_init_pin(card->pins->data1.pin, card->pins->data1.af_idx, default_config);  // USDHC1_DATA1
    sdcard_init_pin(card->pins->data2.pin, card->pins->data2.af_idx, default_config);  // USDHC1_DATA2

    if (pins->cd_b.pin) {
        sdcard_init_pin(card->pins->data3.pin, card->pins->data3.af_idx, default_config);  // USDHC1_DATA3
        sdcard_init_pin(card->pins->cd_b.pin, card->pins->cd_b.af_idx, default_config);  // USDHC1_CD_B
        USDHC_CardDetectByData3(card->usdhc_inst, false);
    } else {
        sdcard_init_pin(card->pins->data3.pin, card->pins->data3.af_idx, no_cd_config);  // USDHC1_DATA3
        USDHC_CardDetectByData3(card->usdhc_inst, true);
    }
}

