micropython/micropython/ports/mimxrt/sdcard.c
    (void)sdcard_reset(card);
    return true;
}

bool sdcard_detect(mimxrt_sdcard_obj_t *card) {
    bool detect = false;

    #if defined MICROPY_USDHC1 && USDHC1_AVAIL
    if ((card->usdhc_inst == USDHC1) && (sdcard_usdhc1_state.inserted == true)) {
        return true;
    }
    #endif
    #if defined MICROPY_USDHC2 && USDHC2_AVAIL
    if ((card->usdhc_inst == USDHC2) && (sdcard_usdhc2_state.inserted == true)) {
        return true;
    }
    #endif

    if (card->pins->cd_b.pin) {
        detect = USDHC_DetectCardInsert(card->usdhc_inst);
    } else {
        USDHC_CardDetectByData3(card->usdhc_inst, true);
        detect = (USDHC_GetPresentStatusFlags(card->usdhc_inst) & USDHC_PRES_STATE_DLSL(8)) != 0;
    }
    /* enable card detect interrupt */
    USDHC_EnableInterruptStatus(card->usdhc_inst, kUSDHC_CardInsertionFlag);
    USDHC_EnableInterruptStatus(card->usdhc_inst, kUSDHC_CardRemovalFlag);

    // Update card state when detected via pin state
    #if defined MICROPY_USDHC1 && USDHC1_AVAIL
    if (card->usdhc_inst == USDHC1) {
        sdcard_usdhc1_state.inserted = detect;
        sdcard_usdhc1_state.initialized = detect ? sdcard_usdhc1_state.initialized : false;
    }
    #endif
    #if defined MICROPY_USDHC2 && USDHC2_AVAIL
    if (card->usdhc_inst == USDHC2) {
        sdcard_usdhc2_state.inserted = detect;
        sdcard_usdhc2_state.initialized = detect ? sdcard_usdhc2_state.initialized : false;
    }
    #endif

    return detect;
}

#endif // MICROPY_PY_MACHINE_SDCARD
